tschiemer/nucleo-audio-delay-poc/stm32_sdio.cpp
#include "mbed.h"

#include "stm32_sdio.h"

#include "stm32l476xx.h"
#include "stm32l4xx_hal_dma.h"
#include "stm32l4xx_hal_rcc.h"
#include "stm32l4xx_hal_rcc_ex.h"

#include "stm32l4xx_hal_gpio.h"
#include "stm32l4xx_hal_gpio_ex.h"

#include "stm32l4xx_hal_sd.h"
#include "stm32l4xx_ll_sdmmc.h"

// https://github.com/akospasztor/stm32-bootloader/blob/master/projects/STM32L496-CustomHw/source/bsp_driver_sd.c

#define SDMMC_IRQ_PRIO  1
#define SD_DMA_IRQ_PRIO 2

using namespace std::chrono;




static SD_HandleTypeDef hsd;

// static DMA_HandleTypeDef hdmatx;
// static DMA_HandleTypeDef hdmarx;


HAL_SD_CardCIDTypeDef pCID;
HAL_SD_CardCSDTypeDef pCSD;
// HAL_SD_CardStatusTypeDef pStatus;
HAL_SD_CardInfoTypeDef pCardInfo;

#define check_error( op, msg )   if ( (op) != HAL_OK) { \
                                printf("HAL ERROR: %s\n", msg); \
                                while(1); \
                            }


/**
* @brief This function handles SDIO global interrupt.
*/
// void _SDIO_IRQHandler(void)
// {
//     HAL_SD_IRQHandler(&hsd);
// }


// void HAL_SD_TxCpltCallback(SD_HandleTypeDef *hsd)
// {
//   UNUSED(hsd);
// }

// /**
//   * @brief Rx Transfer completed callbacks
//   * @param hsd: Pointer SD handle
//   * @retval None
//   */
// void HAL_SD_RxCpltCallback(SD_HandleTypeDef *hsd)
// {
//   /* Prevent unused argument(s) compilation warning */
//   UNUSED(hsd);
// }
/**
* @brief This function handles DMAx stream_n global interrupt. DMA Rx
*/
// void _DMA_Stream_Rx_IRQHandler(void)
// {
//   HAL_DMA_IRQHandler(hsd.hdmarx);
// }

// /**
// * @brief This function handles DMAx stream_n global interrupt. DMA Tx
// */
// void _DMA_Stream_Tx_IRQHandler(void)
// {
//   HAL_DMA_IRQHandler(hsd.hdmatx);
// }

/**
 * @brief DMA2 Channel5 ISR
 * @note  SDMMC DMA Tx, Rx
 */
// void DMA2_Channel5_IRQHandler(void)
// {
//     if((hsd.Context == (SD_CONTEXT_DMA | SD_CONTEXT_READ_SINGLE_BLOCK)) ||
//        (hsd.Context == (SD_CONTEXT_DMA | SD_CONTEXT_READ_MULTIPLE_BLOCK)))
//     {
//         HAL_DMA_IRQHandler(hsd.hdmarx);
//     }
//     else if((hsd.Context ==
//              (SD_CONTEXT_DMA | SD_CONTEXT_WRITE_SINGLE_BLOCK)) ||
//             (hsd.Context ==
//              (SD_CONTEXT_DMA | SD_CONTEXT_WRITE_MULTIPLE_BLOCK)))
//     {
//         HAL_DMA_IRQHandler(hsd.hdmatx);
//     }

// }

/**
 * @brief SDMMC ISR
 */
// void SDMMC1_IRQHandler(void)
// {
//     HAL_SD_IRQHandler(&hsd);
// }

/**
 * @brief Configure the DMA to receive data from the SD card
 * @retval
 *  HAL_ERROR or HAL_OK
 */
static HAL_StatusTypeDef SD_DMAConfigRx(SD_HandleTypeDef* hsd)
{
    static DMA_HandleTypeDef hdma_rx;
    HAL_StatusTypeDef        status = HAL_ERROR;

    /* Configure DMA Rx parameters */
    hdma_rx.Instance                 = DMA2_Channel5;
    hdma_rx.Init.Request             = DMA_REQUEST_7;
    hdma_rx.Init.Direction           = DMA_PERIPH_TO_MEMORY;
    hdma_rx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_rx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_rx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_rx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_rx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsd, hdmarx, hdma_rx);

    /* Stop any ongoing transfer and reset the state */
    HAL_DMA_Abort(&hdma_rx);

    /* Deinitialize the Channel for new transfer */
    HAL_DMA_DeInit(&hdma_rx);

    /* Configure the DMA Channel */
    status = HAL_DMA_Init(&hdma_rx);

    /* NVIC configuration for DMA transfer complete interrupt */
    // HAL_NVIC_SetPriority(DMA2_Channel5_IRQn, SD_DMA_IRQ_PRIO, 0);
    // NVIC_SetVector(DMA2_Channel5_IRQn, (uint32_t) &DMA2_Channel5_IRQHandler);
    // HAL_NVIC_EnableIRQ(DMA2_Channel5_IRQn);

    return status;
}

/**
 * @brief Configure the DMA to transmit data to the SD card
 * @retval
 *  HAL_ERROR or HAL_OK
 */
static HAL_StatusTypeDef SD_DMAConfigTx(SD_HandleTypeDef* hsd)
{
    static DMA_HandleTypeDef hdma_tx;
    HAL_StatusTypeDef        status;

    /* Configure DMA Tx parameters */
    hdma_tx.Instance                 = DMA2_Channel5;
    hdma_tx.Init.Request             = DMA_REQUEST_7;
    hdma_tx.Init.Direction           = DMA_MEMORY_TO_PERIPH;
    hdma_tx.Init.PeriphInc           = DMA_PINC_DISABLE;
    hdma_tx.Init.MemInc              = DMA_MINC_ENABLE;
    hdma_tx.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma_tx.Init.MemDataAlignment    = DMA_MDATAALIGN_WORD;
    hdma_tx.Init.Priority            = DMA_PRIORITY_VERY_HIGH;

    /* Associate the DMA handle */
    __HAL_LINKDMA(hsd, hdmatx, hdma_tx);

    /* Stop any ongoing transfer and reset the state */
    HAL_DMA_Abort(&hdma_tx);

    /* Deinitialize the Channel for new transfer */
    HAL_DMA_DeInit(&hdma_tx);

    /* Configure the DMA Channel */
    status = HAL_DMA_Init(&hdma_tx);

    /* NVIC configuration for DMA transfer complete interrupt */
    // HAL_NVIC_SetPriority(DMA2_Channel5_IRQn, SD_DMA_IRQ_PRIO, 0);
    // NVIC_SetVector(DMA2_Channel5_IRQn, (uint32_t) &DMA2_Channel5_IRQHandler);
    // HAL_NVIC_EnableIRQ(DMA2_Channel5_IRQn);

    return status;
}

// (#)Initialize the SDMMC low level resources by implementing the HAL_SD_MspInit() API:
void HAL_SD_MspInit(SD_HandleTypeDef *hsd)
{
    // printf("MspInit\n");

    // wait_us(1000);

//         (##) Call the function HAL_RCCEx_PeriphCLKConfig with RCC_PERIPHCLK_SDMMC1 for
//         PeriphClockSelection and select SDMMC1 clock source (MSI, main PLL or PLLSAI1)

    RCC_PeriphCLKInitTypeDef RCC_PeriphClkInit;

    HAL_RCCEx_GetPeriphCLKConfig(&RCC_PeriphClkInit);

    RCC_PeriphClkInit.PeriphClockSelection = RCC_PERIPHCLK_SDMMC1;
    RCC_PeriphClkInit.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_MSI;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1Source = RCC_PLLSOURCE_HSI;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1M = 1;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1N = 12;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1P = RCC_PLLP_DIV7;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1Q = RCC_PLLQ_DIV4;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1R = RCC_PLLR_DIV2;
    // RCC_PeriphClkInit.PLLSAI1.PLLSAI1ClockOut = RCC_PLLSAI1_48M2CLK;

