tschiemer/nucleo-audio-delay-poc/stm32_sdio.cpp
// #if defined(RCC_HSI48_SUPPORT)
// #define RCC_SDMMC1CLKSOURCE_HSI48      0x00000000U  /*!< HSI48 clock selected as SDMMC1 clock          */
// #else
// #define RCC_SDMMC1CLKSOURCE_NONE       0x00000000U  /*!< No clock selected as SDMMC1 clock             */
// #endif /* RCC_HSI48_SUPPORT */
// #define RCC_SDMMC1CLKSOURCE_PLLSAI1    RCC_CCIPR_CLK48SEL_0     /*!< PLLSAI1 "Q" clock selected as SDMMC1 clock    */
// #define RCC_SDMMC1CLKSOURCE_PLL        RCC_CCIPR_CLK48SEL_1     /*!< PLL "Q" clock selected as SDMMC1 clock        */
// #define RCC_SDMMC1CLKSOURCE_MSI        RCC_CCIPR_CLK48SEL       /*!< MSI clock selected as SDMMC1 clock            */
// #if defined(RCC_CCIPR2_SDMMCSEL)
// #define RCC_SDMMC1CLKSOURCE_PLLP       RCC_CCIPR2_SDMMCSEL      /*!< PLL "P" clock selected as SDMMC1 kernel clock */
// #endif /* RCC_CCIPR2_SDMMCSEL */



    // printf("MspInit DONE\n");
    // pClkInit.Sdmmc1ClockSelection = RCC_SDMMC1CLKSOURCE_MSI;


    check_error(HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphClkInit), "init: clk");


//         (##) Enable the SDMMC interface clock using __HAL_RCC_SDMMC1_CLK_ENABLE();

    __HAL_RCC_SDMMC1_CLK_ENABLE();


//         (##) SDMMC pins configuration for SD card
//             (+++) Enable the clock for the SDMMC GPIOs using the functions __HAL_RCC_GPIOx_CLK_ENABLE();
//             (+++) Configure these SDMMC pins as alternate function pull-up using HAL_GPIO_Init()
//                   and according to your pin assignment;

	GPIO_InitTypeDef PORT;

    __HAL_RCC_GPIOC_CLK_ENABLE(); // PC8-12
    __HAL_RCC_GPIOD_CLK_ENABLE(); // PD2

	PORT.Mode = GPIO_MODE_AF_PP; // Alternative function mode
	PORT.Speed = GPIO_SPEED_FREQ_VERY_HIGH; //GPIO_Speed_40MHz; // High speed // GPIO_SPEED_FREQ_HIGH
	// PORT.OType = GPIO_OType_PP; // Output push-pull
	PORT.Pull = GPIO_PULLUP;//GPIO_NOPULL;//GPIO_PULLUP; // Pull-up
    PORT.Alternate = GPIO_AF12_SDMMC1;
    
    
    PORT.Pin = GPIO_PIN_8;
	HAL_GPIO_Init(GPIOC, &PORT);

    PORT.Pin = GPIO_PIN_9;
	HAL_GPIO_Init(GPIOC, &PORT);

    PORT.Pin = GPIO_PIN_10;
	HAL_GPIO_Init(GPIOC, &PORT);

    PORT.Pin = GPIO_PIN_11;
	HAL_GPIO_Init(GPIOC, &PORT);

    PORT.Pin = GPIO_PIN_12;
    // PORT.Pull = GPIO_NOPULL;
	HAL_GPIO_Init(GPIOC, &PORT);

    PORT.Pin = GPIO_PIN_2;
	HAL_GPIO_Init(GPIOD, &PORT);

//         (##) On STM32L4Rx/STM32L4Sxx devices, no DMA configuration is need, an internal DMA for SDMMC Peripheral is used.

//         (##) On other devices, perform DMA configuration if you need to use DMA process (HAL_SD_ReadBlocks_DMA()
//              and HAL_SD_WriteBlocks_DMA() APIs).
//             (+++) Enable the DMAx interface clock using __HAL_RCC_DMAx_CLK_ENABLE();
//             (+++) Configure the DMA using the function HAL_DMA_Init() with predeclared and filled.
//         (##) NVIC configuration if you need to use interrupt process when using DMA transfer.
//             (+++) Configure the SDMMC and DMA interrupt priorities using functions
//                   HAL_NVIC_SetPriority(); DMA priority is superior to SDMMC's priority
//             (+++) Enable the NVIC DMA and SDMMC IRQs using function HAL_NVIC_EnableIRQ()
//             (+++) SDMMC interrupts are managed using the macros __HAL_SD_ENABLE_IT()
//                   and __HAL_SD_DISABLE_IT() inside the communication process.
//             (+++) SDMMC interrupts pending bits are managed using the macros __HAL_SD_GET_IT()
//                   and __HAL_SD_CLEAR_IT()


    // HAL_NVIC_SetPriority(SDMMC1_IRQn, 5, 0);
    // NVIC_SetVector(SDMMC1_IRQn, (uint32_t) &_SDIO_IRQHandler);
    // // HAL_NVIC_EnableIRQ(SDMMC1_IRQn);

    // __SDMMC_DMA_ENABLE(SDMMC1);

    // Configure and enable DMA IRQ Channel
    // SDIO IRQ should have a higher priority than DMA IRQ because it needs to
    // preempt the DMA irq handler to set a flag indicating the end of transfer.
    // HAL_NVIC_SetPriority(SDIO_IRQn, IRQ_PRI_SDIO, IRQ_SUBPRI_SDIO);
    // HAL_NVIC_EnableIRQ(SDIO_IRQn);

    // HAL_NVIC_SetPriority(SDMMC1_IRQn, SDMMC_IRQ_PRIO, 0);
    // NVIC_SetVector(SDMMC1_IRQn, (uint32_t) &SDMMC1_IRQHandler);
    // HAL_NVIC_EnableIRQ(SDMMC1_IRQn);

    // HAL_NVIC_DisableIRQ(SDMMC1_IRQn);

    // HAL_NVIC_EnableIRQ(DMA2_Channel5_IRQn);

//         (##) NVIC configuration if you need to use interrupt process (HAL_SD_ReadBlocks_IT()
//              and HAL_SD_WriteBlocks_IT() APIs).
//             (+++) Configure the SDMMC interrupt priorities using function HAL_NVIC_SetPriority();
//             (+++) Enable the NVIC SDMMC IRQs using function HAL_NVIC_EnableIRQ()
//             (+++) SDMMC interrupts are managed using the macros __HAL_SD_ENABLE_IT()
//                   and __HAL_SD_DISABLE_IT() inside the communication process.
//             (+++) SDMMC interrupts pending bits are managed using the macros __HAL_SD_GET_IT()
//                   and __HAL_SD_CLEAR_IT()
//     (#) At this stage, you can perform SD read/write/erase operations after SD card initialization

    // printf("MspInit DONE\n");

    // wait_us(1000);
}

/**
  * @brief  De-Initialize SD MSP.
  * @param  hsd: Pointer to SD handle
  * @retval None
  */
void HAL_SD_MspDeInit(SD_HandleTypeDef *hsd)
{

    /* Disable NVIC for SDIO interrupts */
    HAL_NVIC_DisableIRQ(SDMMC1_IRQn);

    __HAL_RCC_SDMMC1_CLK_DISABLE();
}


HAL_StatusTypeDef sd_init(){

    // printf("sd_init(): start\n");

    hsd.Instance = SDMMC1;
//   uint32_t ClockEdge;            /*!< Specifies the clock transition on which the bit capture is made.
//                                       This parameter can be a value of @ref SDMMC_LL_Clock_Edge                 */
    hsd.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;

#if !defined(STM32L4R5xx) && !defined(STM32L4R7xx) && !defined(STM32L4R9xx) && !defined(STM32L4S5xx) && !defined(STM32L4S7xx) && !defined(STM32L4S9xx)
//   uint32_t ClockBypass;          /*!< Specifies whether the SDMMC Clock divider bypass is
//                                       enabled or disabled.
//                                       This parameter can be a value of @ref SDMMC_LL_Clock_Bypass               */
    hsd.Init.ClockBypass = SDMMC_CLOCK_BYPASS_DISABLE;
#endif /* !STM32L4R5xx && !STM32L4R7xx && !STM32L4R9xx && !STM32L4S5xx && !STM32L4S7xx && !STM32L4S9xx */
    


//   uint32_t ClockPowerSave;       /*!< Specifies whether SDMMC Clock output is enabled or
//                                       disabled when the bus is idle.
//                                       This parameter can be a value of @ref SDMMC_LL_Clock_Power_Save           */
    hsd.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE; 

//   uint32_t BusWide;              /*!< Specifies the SDMMC bus width.
//                                       This parameter can be a value of @ref SDMMC_LL_Bus_Wide                   */
    hsd.Init.BusWide = SDMMC_BUS_WIDE_1B;

//   uint32_t HardwareFlowControl;  /*!< Specifies whether the SDMMC hardware flow control is enabled or disabled.
//                                       This parameter can be a value of @ref SDMMC_LL_Hardware_Flow_Control      */
    hsd.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;


//   uint32_t ClockDiv;             /*!< Specifies the clock frequency of the SDMMC controller.
//                                       This parameter can be a value between Min_Data = 0 and Max_Data = 1023   */
    hsd.Init.ClockDiv = 0;

#if defined(STM32L4R5xx) || defined(STM32L4R7xx) || defined(STM32L4R9xx) || defined(STM32L4S5xx) || defined(STM32L4S7xx) || defined(STM32L4S9xx)
//   uint32_t Transceiver;          /*!< Specifies whether external Transceiver is enabled or disabled.
//                                       This parameter can be a value of @ref SDMMC_LL_Transceiver */
    hsd.Init.Transceiver = SDMMC_TRANSCEIVER_DISABLE;
#endif /* STM32L4R5xx || STM32L4R7xx || STM32L4R9xx || STM32L4S5xx || STM32L4S7xx || STM32L4S9xx */

    // SDMMC1->DTIMER = 0;
    // SDMMC1->DLEN = 0;
    // SDMMC1->DCTRL = 0;

    // hsd.hdmatx = &hdmatx;
    // hsd.hdmarx = &hdmarx;

    HAL_StatusTypeDef status = HAL_SD_Init(&hsd);

    // printf("init = %d\n", state);

    // check_error(state, "Init")

    if (status == HAL_OK){
        check_error(HAL_SD_ConfigWideBusOperation(&hsd, SDMMC_BUS_WIDE_4B), "Wide");
        // check_error(HAL_SD_ConfigSpeedBusOperation(&hsd, SDMMC_SPEED_MODE_HIGH), "Speed");
    }



