tschiemer/nucleo-audio-delay-poc/stm32_sdio.cpp
    // __HAL_RCC_DMA2_CLK_ENABLE();


//     hdmatx.Instance = DMA2_Channel4;

    
//     hdmatx.Init.Request = DMA_REQUEST_0;                  
//      /*!< Specifies the request selected for the specified channel.
//                                            This parameter can be a value of @ref DMA_request */

//     hdmatx.Init.Direction = DMA_MEMORY_TO_PERIPH;                
//    /*!< Specifies if the data will be transferred from memory to peripheral,
//                                            from memory to memory or from peripheral to memory.
//                                            This parameter can be a value of @ref DMA_Data_transfer_direction */

//     hdmatx.Init.PeriphInc = DMA_PINC_DISABLE;                 
//   /*!< Specifies whether the Peripheral address register should be incremented or not.
//                                            This parameter can be a value of @ref DMA_Peripheral_incremented_mode */

//     hdmatx.Init.MemInc = DMA_MINC_DISABLE;                   
//    /*!< Specifies whether the memory address register should be incremented or not.
//                                            This parameter can be a value of @ref DMA_Memory_incremented_mode */

//     hdmatx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;      
//    /*!< Specifies the Peripheral data width.
//                                            This parameter can be a value of @ref DMA_Peripheral_data_size */

//     hdmatx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;         
//    /*!< Specifies the Memory data width.
//                                            This parameter can be a value of @ref DMA_Memory_data_size */

//     hdmatx.Init.Mode = DMA_NORMAL;                     
//    /*!< Specifies the operation mode of the DMAy Channelx.
//                                            This parameter can be a value of @ref DMA_mode
//                                            @note The circular buffer mode cannot be used if the memory-to-memory
//                                                  data transfer is configured on the selected Channel */

//     hdmatx.Init.Priority = DMA_PRIORITY_HIGH;                 
//    /*!< Specifies the software priority for the DMAy Channelx.
//                                            This parameter can be a value of @ref DMA_Priority_level */

//     status = HAL_DMA_Init(&hdmatx);

//     if (status != HAL_OK){
//         printf("dma init err: %d\n", status);
//         while(1);
//     }




//     hdmarx.Instance = DMA2_Channel5;

    
//     hdmarx.Init.Request = DMA_REQUEST_1;                  
//      /*!< Specifies the request selected for the specified channel.
//                                            This parameter can be a value of @ref DMA_request */

//     hdmarx.Init.Direction = DMA_PERIPH_TO_MEMORY;                
//    /*!< Specifies if the data will be transferred from memory to peripheral,
//                                            from memory to memory or from peripheral to memory.
//                                            This parameter can be a value of @ref DMA_Data_transfer_direction */

//     hdmarx.Init.PeriphInc = DMA_PINC_DISABLE;                 
//   /*!< Specifies whether the Peripheral address register should be incremented or not.
//                                            This parameter can be a value of @ref DMA_Peripheral_incremented_mode */

//     hdmarx.Init.MemInc = DMA_MINC_DISABLE;                   
//    /*!< Specifies whether the memory address register should be incremented or not.
//                                            This parameter can be a value of @ref DMA_Memory_incremented_mode */

//     hdmarx.Init.PeriphDataAlignment = DMA_PDATAALIGN_BYTE;      
//    /*!< Specifies the Peripheral data width.
//                                            This parameter can be a value of @ref DMA_Peripheral_data_size */

//     hdmarx.Init.MemDataAlignment = DMA_MDATAALIGN_BYTE;         
//    /*!< Specifies the Memory data width.
//                                            This parameter can be a value of @ref DMA_Memory_data_size */

//     hdmarx.Init.Mode = DMA_NORMAL;                     
//    /*!< Specifies the operation mode of the DMAy Channelx.
//                                            This parameter can be a value of @ref DMA_mode
//                                            @note The circular buffer mode cannot be used if the memory-to-memory
//                                                  data transfer is configured on the selected Channel */

//     hdmarx.Init.Priority = DMA_PRIORITY_HIGH;                 
//    /*!< Specifies the software priority for the DMAy Channelx.
//                                            This parameter can be a value of @ref DMA_Priority_level */

//     status = HAL_DMA_Init(&hdmarx);

//     if (status != HAL_OK){
//         printf("dma init err: %d\n", status);
//         while(1);
//     }


    // HAL_NVIC_SetPriority(DMA2_Channel4_IRQn, 0, 0);
    // HAL_NVIC_EnableIRQ(DMA2_Channel4_IRQn);

    // printf("sd_init(): exit\n");

    return status;
}

void sd_deinit(){
    check_error(HAL_SD_DeInit(&hsd), "DeInit");
// void              HAL_SD_MspDeInit(&hsd);
}

void sd_stat(){

// HAL_StatusTypeDef       HAL_SD_SendSDStatus (&hsd, uint32_t *pSDstatus);

    HAL_SD_CardStateTypeDef state = HAL_SD_GetCardState (&hsd);

    printf("sd card state = %d\n", state);

// #define HAL_SD_CARD_READY          0x00000001U  /*!< Card state is ready                     */
// #define HAL_SD_CARD_IDENTIFICATION 0x00000002U  /*!< Card is in identification state         */
// #define HAL_SD_CARD_STANDBY        0x00000003U  /*!< Card is in standby state                */
// #define HAL_SD_CARD_TRANSFER       0x00000004U  /*!< Card is in transfer state               */
// #define HAL_SD_CARD_SENDING        0x00000005U  /*!< Card is sending an operation            */
// #define HAL_SD_CARD_RECEIVING      0x00000006U  /*!< Card is receiving operation information */
// #define HAL_SD_CARD_PROGRAMMING    0x00000007U  /*!< Card is in programming state            */
// #define HAL_SD_CARD_DISCONNECTED   0x00000008U  /*!< Card is disconnected                    */
// #define HAL_SD_CARD_ERROR          0x000000FFU  /*!< Card response Error                     */

