tschiemer/nucleo-audio-delay-poc/stm32_sdio.cpp
    check_error(HAL_SD_GetCardCID(&hsd, &pCID), "getCID");

    printf("pCID.ManufacturerID = %02X\n", pCID.ManufacturerID);
    printf("pCID.OEM_AppliID = %04X\n", pCID.OEM_AppliID);
    printf("pCID.ProdName1 = %08X\n", pCID.ProdName1);
    printf("pCID.ProdName2 = %02X\n", pCID.ProdName2);
    printf("pCID.ProdRev = %02X\n", pCID.ProdRev);
    printf("pCID.ProdSN = %08X\n", pCID.ProdSN);
    printf("pCID.ManufactDate = %04X\n", pCID.ManufactDate);
    printf("pCID.CID_CRC = %02X\n", pCID.CID_CRC);

    check_error(HAL_SD_GetCardCSD(&hsd, &pCSD), "getCSD");

    printf("pCSD.SysSpecVersion = %d\n", pCSD.SysSpecVersion);
    printf("pCSD.CardComdClasses = %d\n", pCSD.CardComdClasses);
    printf("pCSD.DeviceSize = %d\n", pCSD.DeviceSize);
    printf("pCSD.DeviceSizeMul = %d\n", pCSD.DeviceSizeMul);
    printf("pCSD.MaxBusClkFrec = %d\n", pCSD.MaxBusClkFrec);
    printf("pCSD.TAAC (read time) = %d\n", pCSD.TAAC);
    printf("pCSD.RdBlockLen = %d\n", pCSD.RdBlockLen);
    printf("pCSD.MaxWrBlockLen = %d\n", pCSD.MaxWrBlockLen);
    printf("pCSD.EraseGrSize = %d\n", pCSD.EraseGrSize);
    printf("pCSD.EraseGrMul = %d\n", pCSD.EraseGrMul);
    printf("pCSD.WrProtectGrSize = %d\n", pCSD.EraseGrSize);
    printf("pCSD.WrProtectGrEnable = %d\n", pCSD.WrProtectGrEnable);

    // check_error(HAL_SD_GetCardStatus(&hsd, &pStatus), "getStatus");

    check_error(HAL_SD_GetCardInfo(&hsd, &pCardInfo), "getInfo");
    printf("info.CardType = %d\n", pCardInfo.CardType);
    printf("info.CardVersion = %d\n", pCardInfo.CardVersion);
    printf("info.Class = %d\n", pCardInfo.Class);
    printf("info.RelCardAdd = %d\n", pCardInfo.RelCardAdd);
    printf("info.BlockNbr = %d\n", pCardInfo.BlockNbr);
    printf("info.BlockSize = %d\n", pCardInfo.BlockSize);
    printf("info.LogBlockNbr = %d\n", pCardInfo.LogBlockNbr);
    printf("info.LogBlockSize = %d\n", pCardInfo.LogBlockSize);
    // printf("info.CardSpeed = %d\n", pCardInfo.CardSpeed);

}

bool sd_write(uint32_t address, uint8_t * data){

    HAL_StatusTypeDef status = HAL_OK;

    // /* Invalidate the dma rx handle*/
    // hsd.hdmarx = NULL;

    // /* Prepare the dma channel for a read operation */
    // status = SD_DMAConfigTx(&hsd);
    // if (status != HAL_OK)  printf("status1 = %d\n", status);

    // if (status == HAL_OK){
    //     status = HAL_SD_WriteBlocks_DMA(&hsd, data, address, 1);
    // }
    status = HAL_SD_WriteBlocks(&hsd, data, address, 1, 150);

    if (status != HAL_OK) printf("status2 = %d\n", status);

    

    return status == HAL_OK;
}

bool sd_read(uint32_t address, uint8_t * data){

    // if (hsd.State == )

    HAL_StatusTypeDef status = HAL_OK;

    // /* Invalidate the dma tx handle*/
    // hsd.hdmatx = NULL;

    // /* Prepare the dma channel for a read operation */
    // status  = SD_DMAConfigRx(&hsd);
    // if (status != HAL_OK) printf("status1 = %d\n", status);

    // if (status == HAL_OK){
    //     status = HAL_SD_ReadBlocks_DMA(&hsd, data, address, 1);
    //     if (status != HAL_OK) printf("status2 = %d\n", status);
    // }
    status = HAL_SD_ReadBlocks(&hsd, data, address, 1, 150);

    if (status != HAL_OK) printf("status2 = %d\n", status);


    return status == HAL_OK;
}

void sd_erase(uint32_t from, uint32_t to){
    if (HAL_SD_Erase(&hsd, from, to) != HAL_OK){
        printf("Erase err\n");
        while(1);
    }
}


// void sd_access(){

// // HAL_StatusTypeDef HAL_SD_ReadBlocks     (&hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
// // HAL_StatusTypeDef HAL_SD_WriteBlocks    (&hsd, uint8_t *pData, uint32_t BlockAdd, uint32_t NumberOfBlocks, uint32_t Timeout);
// // HAL_StatusTypeDef HAL_SD_Erase          (&hsd, uint32_t BlockStartAdd, uint32_t BlockEndAdd);
// }

// void sd_test(Timer &t){

//     HAL_StatusTypeDef state = sd_init();

//     if (state != HAL_OK){
//         printf("FAIL!\n");
//         while(1);
//     }

//     // HAL_StatusTypeDef state = HAL_ERROR;
//     // for (int i = 0; i < 1 && state != HAL_OK; i++){
//     //     state = sd_init();
//     //     if (state != HAL_OK){
//     //         wait_us(100);
//     //     }
//     // }
//     // if (state != HAL_OK){
//     //     printf("FAIL!\n");
//     //     while(1);
//     // }

//     wait_us(1000);

//     // sd_stat();

//     t.start();
//     HAL_SD_WriteBlocks(&hsd, blocks, ADDRESS, BLOCK_N, 1000000);
//     t.stop();
//     printf("The time taken was %llu usec\n", duration_cast<microseconds>(t.elapsed_time()).count());

//     t.reset();

//     t.start();
//     HAL_SD_ReadBlocks(&hsd, blocks, ADDRESS, BLOCK_N, 1000000);
//     t.stop();
//     printf("The time taken was %llu usec\n", duration_cast<microseconds>(t.elapsed_time()).count());

//     printf("%s\n", blocks);

//     while(1){


//     }

//     sd_deinit();
// }